---
kind: method
id: M:Autodesk.Revit.DB.Structure.AnalyticalLink.IsAutoGenerated
source: html/09d17b60-55ca-c180-59ec-b4890eed39a1.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalLink.IsAutoGenerated Method

Specifies whether or not an AnalyticalLink was created by an Analytical Element.

## Syntax (C#)
```csharp
public bool IsAutoGenerated()
```

## Returns
True if AnalyticalLink was created by an Analytical Element, false otherwise.